{
    "hero_line1": "Hello,",
    "hero_line2": "I am",
    "hero_line3": "Elisabeth!",
    "intro": "Here's a short overview of who I am.",
    "intro_1": "Hi, I'm Elisabeth, 22 years old, and currently studying Media Informatics in my fifth semester.",
    "intro_2": "I'm passionate about combining technology and creativity — not just making things work, but designing them in a meaningful and thoughtful way. When I work on a project, I give it my full commitment. I quickly familiarize myself with new topics, take on responsibility, and see larger challenges as motivation rather than something intimidating.",
    "intro_3": "It's important to me to continuously grow both professionally and personally. I enjoy working in a team, supporting others whenever I can, and I value honest feedback.",
    "intro_4": "Outside of my studies, I'm involved in many creative activities — from model building and drawing to gaming. For me, experimenting and learning new things is simply part of who I am.",
    "intro_5": "I'm looking for a company where I can contribute long-term, take on responsibility, and grow together as part of a team.",
    "more_info_title": "Want to know more?",
    "more_info_subtitle": "Here you can get a closer look at my background and my work.",
    "more_resume_link": "Resume – An overview of my journey and experiences so far.",
    "more_projects_link": "Projects – A selection of university projects and what I learned from them.",
    "more_skills_link": "Skills – My technical and creative competencies at one glance.",

    "nav_resume": "Resume",
    "nav_skills": "Skills",
    "nav_projects": "Projects",

    "footer_end": "Design & Development by Elisabeth Gehdt",

    "resume_education": "Education",
    "resume_ed_1_date": "since 2023",
    "resume_ed_1_title": "Hochschule Rhein Main",
    "resume_ed_1_description": "Bachelor's degree in Media Informatics, currently in my 5th semester",
    "resume_ed_2_title": "Diltheyschule Wiesbaden",
    "resume_ed_2_description": "Graduated with Abitur with a GPA fo 1.8",
    "resume_ed_3_title": "Schelmengraben Primary School",

    "resume_work": "Work Experience",
    "resume_w_1_title": "Tutor for the module \"Fundamentals of Media Design\"",
    "resume_w_1_date": "2024/2025",
    "resume_w_1_bullet1": "Explaining assignment briefs to students",
    "resume_w_1_bullet2": "Supporting students during task completion",
    "resume_w_1_bullet3": "Communicating complex content in an understandable way",
    "resume_w_1_bullet4": "Strengthening presentation and communication skills",
    
    "resume_w_2_title": "Service Staff at MoschMosch (Location: Wiesbaden)",
    "resume_w_2_date": "July 2023 - July 2025",
    "resume_w_2_bullet1": "Customer service",
    "resume_w_2_bullet2": "Maintaining the dining area and counter",
    "resume_w_2_bullet3": "Teamwork and coordination with colleagues in high-pressure situations",
    "resume_w_2_bullet4": "Organising and prioritising tasks during peak hours",
    
    "resume_w_3_title": "Temporary Staff at Galeria",
    "resume_w_3_date": "Winter 2022",
    "resume_w_3_bullet1": "Stocking shelves and maintaining product displays",
    "resume_w_3_bullet2": "Customer consultation on the sales floor",
    "resume_w_3_bullet3": "Confident handling of stressful situations, e.g. during high customer volumes",
    "resume_w_3_bullet4": "Developing a sense of responsibility through independent work",

    "resume_w_4_title": "Social Internship at Schelmengraben Primary School",
    "resume_w_4_date": "April 2021",
    "resume_w_4_bullet1": "Supervising a class",
    "resume_w_4_bullet2": "Supporting teachers",
    "resume_w_4_bullet3": "Developing patience, empathy and communication skills when working with children",

    "resume_w_5_title": "Work Internship at QBF Deutschland",
    "resume_w_5_date": "October 2021",
    "resume_w_5_bullet1": "Taking on and completing a project in Python",
    "resume_w_5_bullet2": "Independently familiarising myself with new technologies",
    "resume_w_5_bullet3": "Presenting the project to a specialist audience",

    "milefiz_modul": "Software Engineering Project",
    "milefiz_descr_1": "The objective of this project was to reimagine and technically implement the classic board game Malefiz as an online-capable first-person multiplayer game. The focus was on a network-based multiplayer architecture that enables multiple players to play together in real-time in an interactive 3D environment.",
    "milefiz_descr_2": "Development took place across five sprints following Scrum methodology. As stakeholder, Prof. Dr. Weitz defined key requirements, including five game pieces per player, import and export functions, an integrated map editor, strategic repositioning of barriers, and mini-games between players.",
    "milefiz_tasks_1": "Scrum Master for Sprint 3",
    "milefiz_descr_3": "The project was implemented by a team of ten members.",
    "milefiz_tasks_title": "My tasks:",
    "milefiz_tasks_2": "Development of the balloon mini-game",
    "milefiz_tasks_3": "Creation of game assets",
    "milefiz_tasks_4": "Design and layout of the standard game board",
    "milefiz_tasks_7": "Implementation of jump mechanics",
    "milefiz_tasks_5": "Implementation of the website landing page",
    "milefiz_tasks_6": "Backend implementation of the energy system",
    "milefiz_tasks_8": "Selection of the game character (meeple)",
    "milefiz_learning_title": "What I learned:",
    "milefiz_learning_1": "Agile work following Scrum methodologies",
    "milefiz_learning_2": "Practical application of Scrum processes",
    "milefiz_learning_3": "Effective collaboration in larger teams",
    "milefiz_learning_4": "3D graphics programming with Three.js",
    "milefiz_learning_5": "Sprint planning and execution as Scrum Master",
    "milefiz_learning_6": "Team leadership and project management",
    "milefiz_poster_title": "Project Poster",
    "milefiz_galery_title": "Gallery",
    "milefiz_galery_1": "Balloon Mini-Game",
    "milefiz_galery_2": "Map Editor",
    "milefiz_galery_3": "Landing Homepage",
    "milefiz_galery_4": "Lobby Search",
    "milefiz_galery_5": "Lobby Management",

    "lernwolke_modul": "Human-Computer Interaction",
    "lernwolke_descr_1": "The objective of this project was to identify a concrete problem based on a guiding 'How-might-we' question and develop a solution concept. The implementation was to be realized as a non-WIMP application, deliberately going beyond classical graphical user interfaces with windows, icons, menus, and mouse interaction.",
    "lernwolke_descr_2": "The evaluation focused on conceptual development, so a functional prototype was sufficient as an implementation form. Initially, several different solution approaches were developed, analyzed, and compared. Based on this, a final solution was selected and subsequently developed and implemented as a prototype.",
    "lernwolke_video": "Demo Video",
    "lernwolke_pdf": "Documentation",
    "lernwolke_tasks_title": "My tasks:",
    "lernwolke_tasks_1": "Creation of sketches and animations",
    "lernwolke_tasks_2": "Creation of final visuals",
    "lernwolke_tasks_3": "Implementation in Unity",
    "lernwolke_tasks_4": "Testing on Apple Vision Pro 2",
    "lernwolke_tasks_5": "Documentation of the project in the form of a booklet",
    "lernwolke_tasks_6": "Creation of the demo video",
    "lernwolke_learning_title": "What I learned:",
    "lernwolke_learning_1": "Development of a concept based on theoretical foundations",
    "lernwolke_learning_2": "Working in Unity",
    "lernwolke_learning_3": "Creation of spritesheets",
    "lernwolke_learning_4": "Implementation of an AR application in Unity",
    "lernwolke_learning_5": "Working with Apple Vision Pro 2",
    "lernwolke_resources_title": "Project Material",
    "lernwolke_resources_subtitle": "Find additional materials like spritesheets, the Unity project, and assets here:",
    "lernwolke_resources_link": "Hessenbox – All project files and resources",
    
    "hollowKnight_modul": "Digital Media Production",
    "hollowKnight_descr_1": "The objective of this module was to develop a secure and structured approach to Adobe After Effects. The focus was on the conception and production of a 1:30–2:00 minute video that combines animated elements, typographic design, and targeted cuts and transitions.",
    "hollowKnight_descr_2": "The topic, visual direction, and content implementation were freely selectable, so in addition to technical skills, conceptual and design decisions were developed independently.",
    "hollowKnight_tasks_title": "My tasks:",
    "hollowKnight_tasks_1": "Developing a story",
    "hollowKnight_tasks_2": "Selecting a theme",
    "hollowKnight_tasks_3": "Creating the storyboard",
    "hollowKnight_tasks_4": "Creation of assets in Procreate and Adobe Illustrator",
    "hollowKnight_tasks_5": "Animation of individual scenes in Adobe After Effects",
    "hollowKnight_learning_title": "What I learned:",
    "hollowKnight_learning_1": "Creating storyboards",
    "hollowKnight_learning_2": "Working with Adobe After Effects",
    "hollowKnight_learning_3": "Puppet Pin Tool animation in Adobe After Effects",

    "doener_modul": "Web-based Applications",
    "doener_title": "Döner Rental",
    "doener_descr_1": "The objective of this project was to develop a complete döner rental system that integrates backend and frontend components. The goal was to create a web-based system where users can view, rent, and return döners, while administrators manage users and döners.",
    "doener_descr_2": "The implementation took place over several weeks in the 4th semester, with the frontend realized using Vue.js and Thymeleaf. The backend is based on Spring Boot and communicates with the frontend via REST APIs. Gradle was used for build and project management.",
    "doener_descr_3": "The project was carried out as a group work, with iterative development and integration of the various system components in focus. The project was implemented in collaboration with Leon Schäfer.",
    "doener_screens_title": "Completed Döner Rental System",
    "doener_screens_1": "List of all created döners",
    "doener_screens_2": "Editing a döner",
    "doener_screens_3": "Implementation of i18n (Internationalization)",
    "doener_screens_4": "Admin view for user management",
    "doener_repo_title": "GitHub Repository - Program Code",
    "doener_repo_descr": "The complete project can be found here:",
    "doener_repo_link": "GitHub Repository - View the program code and implementation",
    "doener_tasks_title": "My tasks:",
    "doener_tasks_1": "Building a backend system with Spring Boot for managing döner rental logic including API endpoints",
    "doener_tasks_2": "Implementation of a REST API for communication between frontend and backend",
    "doener_tasks_3": "Creation of a frontend client with Vue.js providing the user interface for the system",
    "doener_tasks_4": "Integration of a login function (with simple fixed credentials for demonstration)",
    "doener_tasks_5": "Definition and modeling of central data structures (e.g. döners, ingredients, inventory) in the backend",
    "doener_tasks_6": "Building the rental logic to allow users to rent and return döners in the system",
    "doener_tasks_7": "Use of Gradle as a build tool for project configuration and server startup",
    "doener_tasks_8": "Linking frontend and backend functionalities via defined API routes and data retrieval",
    "doener_learning_title": "What I learned:",
    "doener_learning_1": "Experience in full-stack development with Vue.js, Thymeleaf, and Spring Boot",
    "doener_learning_2": "Implementation and use of REST APIs for frontend-backend communication",
    "doener_learning_3": "Data modeling for döners, ingredients, inventory, and rental logic",
    "doener_learning_4": "Use of Gradle for build, project management, and server startup",
    "doener_learning_5": "Implementation of login and user management functionality",

    "melody_modul": "Introduction to Interactive Applications",
    "melody_descr_1": "The objective of this project was to develop an interactive JavaFX application as a team. The application was to be structured according to the MVC principle and implement a self-designed game idea.",
    "melody_descr_2": "In addition to programming, the project deepened knowledge of structuring JavaFX applications, including the integration of music and sound effects that were thematically and functionally integrated into the game.",
    "melody_descr_3": "The project was implemented as group work with Leon Schäfer and Marlon Stamm, with emphasis on collaboration, task coordination, and the exchange of ideas during development.",
    "melody_tasks_title": "My tasks:",
    "melody_tasks_1": "Development of the user interface and scene logic with JavaFX (UI layouts, animations, controls)",
    "melody_tasks_2": "Implementation of the MVC pattern, including separation of Model, View, and Controller",
    "melody_tasks_3": "Integration and control of music and sound effects in the game context",
    "melody_tasks_4": "Implementation of game mechanics and interactivity (event handling, player controls)",
    "melody_tasks_5": "Collaboration in the team for planning, coordination, and development of the overall application",
    "melody_tasks_6": "Creation of appropriate assets",
    "melody_learning_title": "What I learned:",
    "melody_learning_1": "Deepened JavaFX skills, particularly in building interactive user interfaces and scene control",
    "melody_learning_2": "Strengthened practical application of MVC architecture and understanding of the clean separation of Model, View, and Controller",
    "melody_learning_3": "Implemented integration of music and sound effects and learned how to functionally and thematically embed audiovisual elements",
    "melody_learning_4": "Developed game mechanics and event logic, gaining experience in controlling interactions and workflows",
    "melody_learning_5": "Practiced teamwork and improved the ability to coordinate, distribute tasks, and collaborate in a group project",
    "melody_learning_6": "First experience working collaboratively in a Git repository",

    "mp3_modul": "Introduction to Interactive Applications",
    "mp3_title": "MP3 Player",
    "mp3_descr_1": "The objective of this project was to implement an MP3 player as an introduction to JavaFX development. The focus was on implementing fundamental music player functions such as play, pause, shuffle, repeat, volume control, progress display, and playlist view.",
    "mp3_descr_2": "The application was to be structured according to the MVC principle to ensure a clear separation between user interface, logic, and data storage. Additionally, visual elements such as album artwork and progress bars were to be integrated into the interface.",
    "mp3_descr_3": "The project was created in collaboration with Leon Schäfer.",
    "mp3_tasks_title": "My tasks:",
    "mp3_tasks_1": "Development of the user interface and scene logic with JavaFX (UI layouts, animations, controls)",
    "mp3_tasks_2": "Implementation of the MVC pattern, including separation of Model, View, and Controller",
    "mp3_tasks_3": "Integration and control of music and sound effects",
    "mp3_tasks_4": "Implementation of MP3 logic (pause, seek, playlist display)",
    "mp3_tasks_5": "Development of an attractive user interface",
    "mp3_learning_title": "What I learned:",
    "mp3_learning_1": "First knowledge in JavaFX",
    "mp3_learning_2": "First practical application of MVC architecture",
    "mp3_learning_3": "Integration of music and sound effects in an interactive system",
    "mp3_learning_4": "First experience working collaboratively in a Git repository",

    "yd_descr_1": "The objective of this project was to design a complete website for a freely invented yet realistically conceived startup. For this, a coherent business concept including name, logo, and visual identity was to be developed first.",
    "yd_descr_2": "In the further course, wireframes were to be created to structure the website, a consistent style guide was to be defined, and based on this, an interactive clickable prototype was to be implemented. Wireframes and prototype were to be realized in Figma. The principle of Atomic Design was to be applied so that reusable, modular UI components were developed that could be consistently used multiple times and adjusted centrally.",
    "yd_descr_3": "This project was a group work with Paula Petrovic and Jacob Scharf and was intended to promote both conceptual and design skills in the field of UI/UX design.",
    "yd_dummy_title": "Figma Prototype",
    "yd_tasks_title": "My tasks:",
    "yd_tasks_1": "Developing an independent startup concept including name, business idea, and brand identity",
    "yd_tasks_2": "Designing a visual identity with logo, color palette, and typography",
    "yd_tasks_3": "Create structured wireframes in Figma to define page layout and user navigation",
    "yd_tasks_4": "Develop a consistent style guide to establish design guidelines and UI rules",
    "yd_tasks_5": "Implement an interactive clickable prototype in Figma to realistically simulate user interaction",
    "yd_tasks_6": "Documentation of the project in the form of a custom-designed booklet",
    "yd_learning_title": "What I learned:",
    "yd_learning_1": "A comprehensive understanding of developing a brand identity was built",
    "yd_learning_2": "Knowledge of creating wireframes and user-oriented site structure was deepened",
    "yd_learning_3": "Confidence in working with style guides and design systems was gained",
    "yd_learning_4": "Experience in creating interactive prototypes in Figma was gathered",
    "yd_learning_5": "The ability to work as a team in the design process was further developed",

    "bkl_modul": "Introduction to Design (Fundamentals of Media Design)",
    "bkl_descr_1": "The objective of this project was the design development of a booklet in which various design tasks are brought together. Over several weeks, worksheets on different design topics were worked on, which dealt with fundamental design principles.",
    "bkl_descr_2": "The individual tasks were not only to be understood theoretically but also applied practically and worked out design-wise. The conscious application of design fundamentals such as layout, typography, color theory, and composition was at the forefront.",
    "bkl_descr_3": "Finally, all processed content was to be brought together in a consistently designed booklet and prepared for printing, resulting in a physical end product.",
    "bkl_pdf": "The finished booklet",
    "bkl_tasks_title": "My tasks:",
    "bkl_tasks_1": "Design-wise processing of weekly worksheets on various design topics",
    "bkl_tasks_2": "Practical application of design fundamentals such as typography, layout, color theory, and composition",
    "bkl_tasks_3": "Structured wireframes in Figma were created to define page layout and user navigation",
    "bkl_tasks_4": "A consistent style guide was developed to establish design guidelines and UI rules",
    "bkl_tasks_5": "An interactive clickable prototype in Figma was implemented to realistically simulate user interaction",
    "bkl_tasks_6": "Documentation of the project in the form of a custom-designed booklet",
    "bkl_learning_title": "What I learned:",
    "bkl_learning_1": "Understanding of fundamental design principles was built",
    "bkl_learning_2": "Confidence in handling typography, layout, and color design was developed",
    "bkl_learning_3": "A sense for visual consistency and design systematicity was strengthened",
    "bkl_learning_4": "Knowledge in print preparation was expanded",
    "bkl_learning_5": "The ability to bring individual tasks together into a coherent overall project was fostered"
}